src/InformationRegisters/кфкВходящиеСообщения/кфкВходящиеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f414732c-dcdc-4e52-825c-4b00cf4fa6e2">
  <name>кфкВходящиеСообщения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="40e13da9-a528-4570-883e-2c907efb0364">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="b7a46c86-21a3-43b1-9f53-d74a8fdccb2f">
    <name>Заголовки</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="40670889-dab8-4e97-83f0-746662cb9168">
    <name>ТелоСообщения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="bd26b858-29df-4c6e-ba4a-75d5f9a60683">
    <name>Консьюмер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="01079ff5-5033-46d9-af80-34e06690eabd">
    <name>Топик</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="674a635a-7c60-483a-aa26-18543e47cd4e">
    <name>Раздел</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f6fdbc5d-cd8b-4e9f-aef2-14902fcd3d2b">
    <name>Смещение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>32</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9504695b-0eb6-4677-b1ca-4823a52689aa">
    <name>КлючСообщения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="09c9dd9a-de2f-4730-a615-93cb72742570">
    <name>ДатаЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bfe7b38d-d429-4caa-b272-7de24cf9ca09">
    <name>ДатаЗагрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bf1cd89a-5799-49dd-be8b-f171cd5245a8">
    <name>ДатаОбработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f591f9ce-cc6e-447d-9dbb-d8f97d14b471">
    <name>ДлОбработкиМС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b6867e51-27ef-412a-8310-5e541572a80d">
    <name>ТекстЖурнала</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5ce30598-30ab-4cb8-8e33-07a80a4c3ca5">
    <name>КоличествоОбработок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d7d9478d-81b5-41b6-aef7-75804ffeda2f">
    <name>МеткаИзмененияМС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="f5651cfa-879f-4b36-a83a-fd15928fdcb5">
    <name>КлючЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="111ca233-437e-423e-bb9a-fac72f0cf50c">
    <name>ДатаЗагрузкиМС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/кфкИсходящиеСообщения/кфкИсходящиеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9bb60e0f-842a-4fa4-ac2b-edd89101fe4a">
  <name>кфкИсходящиеСообщения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="6b53242f-90ec-4441-929d-e40a10912da1">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="645be078-31fe-4466-b372-8bb9bfa3f5be">
    <name>ИсходныеДанные</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="c8b56203-f691-4ecb-baa5-349014dc183d">
    <name>ЭтоУдаление</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="219a3ae5-d22d-467d-b06a-ac34b1cb0b28">
    <name>КлючСообщения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="afab001f-7c73-48bc-8796-c31e7bf52af0">
    <name>Заголовки</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="bb437059-733a-4568-833f-93a08c527b14">
    <name>ТелоСообщения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="edf8a9c9-f606-41ee-a73e-b96b0e7cca2a">
    <name>Продюсер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="999a4a8e-9e06-4003-bef9-df9a1040dd3c">
    <name>ТипОбъект</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="292b6eec-1780-46e7-8559-9493aa1ddb42">
    <name>ТипИсходныхДанных</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c7c42290-9fd9-47f2-aab1-06ebdfba17ce">
    <name>КлючОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="46012b4d-4b78-4cbd-8d0d-18101a391f7f">
    <name>СобытиеРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="95dd5ec5-8b2e-459f-a936-2a5d2be7b2a4">
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="28f1a3aa-a8a0-404d-97be-3f9ebb177a1a">
    <name>ДатаОбработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ee05bfa3-5c0b-4ad6-962d-b2ec05fed003">
    <name>ДатаВыгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e799e980-8ada-4039-a30c-da9f60bebb2d">
    <name>ДлОбработкиМС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a856e5db-41c4-4e7d-981e-2c56dcb0b477">
    <name>ТекстЖурнала</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6d139c82-f66c-4620-a76a-8cb29ad47bce">
    <name>КоличествоОбработок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="285c25ea-c7ab-4ec5-b049-028ac1a7e72d">
    <name>КоличествоВыгрузок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="aa816974-7fec-4c4a-a209-74cbe7e41026">
    <name>МеткаИзмененияМС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="bc51b526-bde0-4420-be0b-4163f25aa1ed">
    <name>КлючЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="dcea6dff-ee4d-4454-ab67-2dff64dc7131">
    <name>ДатаРегистрацииМС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/кфкСтатусыСообщений/кфкСтатусыСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="90c87861-83c3-4174-81dd-550f291515d7">
  <name>кфкСтатусыСообщений</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="e87ed46a-b4fe-41ad-a05b-c7d43a993d59">
    <name>Новое</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4aa47c21-1293-47d6-b3ab-9d29a043b1dc">
    <name>Обработано</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="82907498-6643-4090-a81d-dd1982638a68">
    <name>ОбработкаОтменена</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="bb65cb4f-750e-4084-b787-633ed9393166">
    <name>ОшибкаОбработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="31aa5e8e-008e-4e64-bdea-a9307ad0bcc1">
    <name>Выгружено</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2aad9bb4-aca4-411a-8268-a2c8d7a9efe8">
    <name>ОшибкаВыгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b1566b75-70c6-497a-8ff6-bdaa91eddbbe">
    <name>ВыгрузкаОтменена</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/CommonModules/ОМ_кфкФоновыеОперацииСлужебный_ПолучениеОчистка/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Регистрирует контракты получения, повторов и очистки.
Процедура ИсполняемыеСценарии() Экспорт

	ЮТТесты
		.ВТранзакции()
		.После("ПослеКаждогоТеста")
		.ДобавитьТестовыйНабор("Общий модуль кфкФоновыеОперацииСлужебный. Получение")
			.Тег("Модульные").Тег("кфкФоновыеОперацииСлужебный").Тег("Получение")
			.ДобавитьСерверныйТест("ВыборкаДесериализации_ОтбираетСвободныеВПорядкеМетки")
				.Тег("ОтбираетСвободныеВПорядкеМетки")
			.ДобавитьСерверныйТест("ВыборкаДесериализацииВПотоке_УчитываетКлючДатуИПоток")
				.Тег("УчитываетКлючДатуИПоток")
			.ДобавитьСерверныйТест("ДобавитьВходящееСообщениеВОчередь_СохраняетПолезнуюНагрузку")
				.Тег("СохраняетПолезнуюНагрузку")
			.ДобавитьСерверныйТест("ДобавитьВходящееСообщениеВОчередь_РазличаетПустойИОтсутствующийКлюч")
				.Тег("РазличаетПустойИОтсутствующийКлюч")
			.ДобавитьСерверныйТест("ОбработчикЗагрузкиПакетСообщений_СогласуетПризнакЗагрузки")
				.Тег("СогласуетПризнакЗагрузки")
				.СПараметрами(Ложь)
				.СПараметрами(Истина)
			.ДобавитьСерверныйТест("ОбработчикЗагрузкиПакетСообщений_ОшибкаЗаписиНеСохраняетПакет")
				.ВТранзакции(Ложь)
				.Тег("ОшибкаЗаписиНеСохраняетПакет")
		.ДобавитьТестовыйНабор("Общий модуль кфкФоновыеОперацииСлужебный. Дедупликация")
			.Тег("Модульные").Тег("кфкФоновыеОперацииСлужебный").Тег("Дедупликация")
			.ДобавитьСерверныйТест("ОбработатьВходящееСообщение_ХэшПоявляетсяТолькоПослеУспеха")
				.Тег("ХэшПоявляетсяТолькоПослеУспеха")
				.СПараметрами(Истина)
				.СПараметрами(Ложь)
			.ДобавитьСерверныйТест("ОбработатьВходящееСообщение_ОтключеннаяИдемпотентностьНеПодавляетПовтор")
				.Тег("ОтключеннаяИдемпотентностьНеПодавляетПовтор")
				.СПараметрами(Ложь)
				.СПараметрами(Истина)
			.ДобавитьСерверныйТест("Десериализация_ДваСообщенияНеСмешиваютСвойства")
				.Тег("НеСмешиваетСвойства")
			.ДобавитьСерверныйТест("ОбработчикДесериализацииСообщений_СохраняетХэшИПодавляетСледующийПакет")
				.Тег("СохраняетХэшИПодавляетСледующийПакет")
		.ДобавитьТестовыйНабор("Общий модуль кфкФоновыеОперацииСлужебный. Повторы")
			.Тег("Модульные").Тег("кфкФоновыеОперацииСлужебный").Тег("Повторы")
			.ДобавитьСерверныйТест("ВыборкаВозвратаВОчередь_ПроверяетГраницуИПопытки")
				.Тег("ПроверяетГраницуИПопытки")
				.СПараметрами(-1, 2, Ложь)
				.СПараметрами(0, 2, Ложь)
				.СПараметрами(1, 2, Истина)
				.СПараметрами(1, 3, Ложь)
				.СПараметрами(1, 4, Ложь)
			.ДобавитьСерверныйТест("ВыборкаВозвратаВОчередь_НеВозвращаетУспешныеСообщения")
				.Тег("НеВозвращаетУспешныеСообщения")
			.ДобавитьСерверныйТест("ВыборкаВозвратаВОчередь_СохраняетЗанятыйКлюч")
				.Тег("СохраняетЗанятыйКлюч")
			.ДобавитьСерверныйТест("ВыборкаВозвратаВОчередь_СохраняетНовуюРегистрацию")
				.Тег("СохраняетНовуюРегистрацию")
			.ДобавитьСерверныйТест("ВыборкаВозвратаВОчередь_ОграничиваетПорциюВПорядкеМетки")
				.Тег("ОграничиваетПорцию")
			.ДобавитьСерверныйТест("ВыборкаДублейИсходящихСообщений_УчитываетЗанятостьИНовуюРегистрацию")
				.Тег("УчитываетЗанятостьИНовуюРегистрацию")
				.СПараметрами(Ложь)
				.СПараметрами(Истина)
			.ДобавитьСерверныйТест("ВыборкаДублейИсходящихСообщений_СоблюдаетГраницуИСтатус")
				.Тег("СоблюдаетГраницуИСтатус")
				.СПараметрами(-1, "Новое", Ложь)
				.СПараметрами(0, "Новое", Истина)
				.СПараметрами(1, "Новое", Истина)
				.СПараметрами(0, "ОшибкаОбработки", Истина)
				.СПараметрами(0, "Обработано", Истина)
				.СПараметрами(0, "ОшибкаВыгрузки", Истина)
				.СПараметрами(0, "Выгружено", Ложь)
				.СПараметрами(0, "ОбработкаОтменена", Ложь)
			.ДобавитьСерверныйТест("ОбработатьВыборкуДублей_ОтменяетТолькоСтаруюРегистрацию")
				.Тег("ОтменяетТолькоСтаруюРегистрацию")
		.ДобавитьТестовыйНабор("Общий модуль кфкФоновыеОперацииСлужебный. Очистка")
			.Тег("Модульные").Тег("кфкФоновыеОперацииСлужебный").Тег("Очистка")
			.ДобавитьСерверныйТест("РассчитатьУказательУдаления_УчитываетРежим")
				.Тег("УчитываетРежим")
				.СПараметрами(-1, Неопределено, Неопределено)
				.СПараметрами(-1, 50, Неопределено)
				.СПараметрами(-2, Неопределено, Неопределено)
				.СПараметрами(-2, 50, 50)
			.ДобавитьСерверныйТест("РассчитатьУказательУдаления_СоблюдаетВременнуюГраницу")
				.Тег("СоблюдаетВременнуюГраницу")
				.СПараметрами(0, Неопределено, 172800000)
				.СПараметрами(1, Неопределено, 86400000)
				.СПараметрами(0.5, Неопределено, 129600000)
				.СПараметрами(1, 86399999, 86399999)
				.СПараметрами(1, 86400000, 86400000)
				.СПараметрами(1, 86400001, 86400000)
			.ДобавитьСерверныйТест("РассчитатьУказательУдаления_ОтклоняетНекорректныйСрок")
				.Тег("ОтклоняетНекорректныйСрок")
			.ДобавитьСерверныйТест("ВыборкаХэшСуммыСообщений_СохраняетГраничныеЗаписи")
				.Тег("СохраняетГраницу")
			.ДобавитьСерверныйТест("ВыборкаУстаревшихСообщений_СохраняетГраницуИЧужойСтатус")
				.Тег("СохраняетГраницуИЧужойСтатус")
				.СПараметрами(Ложь)
				.СПараметрами(Истина)
			.ДобавитьСерверныйТест("УдалитьЗаписиРС_УдаляетПолныйПакетИХвост")
				.Тег("УдаляетПолныйПакетИХвост")
				.СПараметрами(Ложь)
				.СПараметрами(Истина)
			.ДобавитьСерверныйТест("ВыборкаУстаревшихСообщений_ОтключенныйСрокСохраняетДанные")
				.Тег("ОтключенныйСрокСохраняетДанные")
				.СПараметрами(Ложь)
				.СПараметрами(Истина)
			.ДобавитьСерверныйТест("ВыборкаУстаревшихСообщений_ПрименяетСрокКСвоемуСтатусу")
				.Тег("УчитываетСрокСтатуса")
				.СПараметрами(Ложь, "СрокХраненияНезавершенных", "Новое")
				.СПараметрами(Ложь, "СрокХраненияНезавершенных", "Обработано")
				.СПараметрами(Ложь, "СрокХраненияОшибкиОбработкиИсходящих", "ОшибкаОбработки")
				.СПараметрами(Ложь, "СрокХраненияОтмененныхИсходящих", "ОбработкаОтменена")
				.СПараметрами(Ложь, "СрокХраненияОтмененныхИсходящих", "ВыгрузкаОтменена")
				.СПараметрами(Ложь, "СрокХраненияОшибкиОтправки", "ОшибкаВыгрузки")
				.СПараметрами(Истина, "СрокХраненияНезавершенных", "Новое")
				.СПараметрами(Истина, "СрокХраненияОшибкиОбработкиВходящих", "ОшибкаОбработки")
				.СПараметрами(Истина, "СрокХраненияОтмененныхВходящих", "ОбработкаОтменена")
		.ДобавитьТестовыйНабор("Общий модуль кфкФоновыеОперацииСлужебный. Контроль SLA")
			.Тег("Модульные").Тег("кфкФоновыеОперацииСлужебный").Тег("КонтрольСоглашенияУровняСервиса")
			.ДобавитьСерверныйТест("КонтрольSLA_УчитываетДлительностьИДиапазонВходящих")
				.Тег("УчитываетДлительностьИДиапазонВходящих")
				.СПараметрами(9, 720000, 720000, 0)
				.СПараметрами(10, 720000, 720000, 0)
				.СПараметрами(11, 720000, 720000, 1)
				.СПараметрами(11, 720000, 600000, 1)
				.СПараметрами(11, 780000, 780000, 0)
			.ДобавитьСерверныйТест("КонтрольSLA_УчитываетВсеПоказатели")
				.Тег("ВсеПоказатели")
			.ДобавитьСерверныйТест("КонтрольSLA_ПовторНеУчитываетПрежниеОшибки")
				.Тег("ПовторныйЗапуск")
			.ДобавитьСерверныйТест("КонтрольSLA_ФормируетСообщениеПоПоказателям")
				.Тег("Сообщение");

КонецПроцедуры

// Сбрасывает настройки внешней границы после каждого теста.
Процедура ПослеКаждогоТеста() Экспорт

	Мокито.Сбросить();
	Контекст = ЮТест.КонтекстТеста();
	Очередь = Неопределено; // РегистрСведенийНаборЗаписей.кфкВходящиеСообщения, Неопределено
	Если Не Контекст.Свойство("ют_ОчередьОчисткиПослеСбоя", Очередь) Тогда
		Возврат;
	КонецЕсли;

	Для Каждого СтрокаОчереди Из Очередь Цикл

		Запись = РегистрыСведений.кфкВходящиеСообщения.СоздатьМенеджерЗаписи();
		Запись.КлючЗаписи = СтрокаОчереди.КлючЗаписи;
		Запись.ДатаЗагрузкиМС = СтрокаОчереди.ДатаЗагрузкиМС;
		Запись.Удалить();

	КонецЦикла;
	Контекст.Удалить("ют_ОчередьОчисткиПослеСбоя");

КонецПроцедуры

#Область КонтрольSLA

// Проверяет минуты SLA и независимость верхней границы входящих от исходящих.
//
// Параметры:
//  ДлительностьМинут - Число - время обработки сообщения при SLA 10 минут.
//  СмещениеСообщенияМС - Число - метка изменения относительно начала суток.
//  СмещениеГраницыИсходящихМС - Число - верхняя граница исходящих относительно начала суток.
//  ОжидаемыйПрирост - Число - вклад нового сообщения в число нарушений входящих.
Процедура КонтрольSLA_УчитываетДлительностьИДиапазонВходящих(
		ДлительностьМинут, СмещениеСообщенияМС, СмещениеГраницыИсходящихМС, ОжидаемыйПрирост) Экспорт

	НачалоСутокМС = 1767225600000;
	ГраницаВходящихМС = НачалоСутокМС + 720000;
	ИндексПоказателяВходящих = 3;
	Параметры = Новый Структура;
	Параметры.Вставить("ВремяSLAВходящих", 10);
	Параметры.Вставить("ВремяSLAИсходящих", 20);
	Диапазон = Новый Структура;
	Диапазон.Вставить("ВхОт", НачалоСутокМС);
	Диапазон.Вставить("ВхДо", ГраницаВходящихМС);
	Диапазон.Вставить("ИсхОт", НачалоСутокМС);
	Диапазон.Вставить("ИсхДо", НачалоСутокМС + СмещениеГраницыИсходящихМС);

	// Приращение исключает влияние ранее существовавших сообщений в том же диапазоне.
	ДоЗаписи = кфкФоновыеОперацииСлужебный.ют_ПоказателиКонтроля(Параметры, Диапазон);
	НачальнаяВыборка = ДоЗаписи[ИндексПоказателяВходящих].Выбрать();
	ЮТест.ОжидаетЧто(НачальнаяВыборка.Следующий(), "начальный показатель присутствует").ЭтоИстина();
	ИсходноеКоличество = НачальнаяВыборка.Количество; // Число

	Ключ = НоваяЗаписьОчереди(Истина, НачалоСутокМС,
		Перечисления.кфкСтатусыСообщений.Обработано);
	Запись = РегистрыСведений.кфкВходящиеСообщения.СоздатьМенеджерЗаписи();
	Запись.КлючЗаписи = Ключ;
	Запись.ДатаЗагрузкиМС = НачалоСутокМС;
	Запись.Прочитать();
	Запись.ДатаЗагрузки = Дата(2026, 1, 1);
	Запись.МеткаИзмененияМС = НачалоСутокМС + СмещениеСообщенияМС;
	СекундВМинуте = 60;
	Запись.ДатаОбработки = Запись.ДатаЗагрузки + ДлительностьМинут * СекундВМинуте;
	Запись.Записать();
	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкВходящиеСообщения")
		.СодержитЗаписи(ЮТест.Предикат().Реквизит("КлючЗаписи").Равно(Ключ)
			.Реквизит("ДатаЗагрузкиМС").Равно(НачалоСутокМС)
			.Реквизит("МеткаИзмененияМС").Равно(НачалоСутокМС + СмещениеСообщенияМС)
			.Реквизит("ДатаЗагрузки").Равно(Запись.ДатаЗагрузки)
			.Реквизит("ДатаОбработки").Равно(Запись.ДатаОбработки)
			.Реквизит("Статус").Равно(Перечисления.кфкСтатусыСообщений.Обработано));

	ПослеЗаписи = кфкФоновыеОперацииСлужебный.ют_ПоказателиКонтроля(Параметры, Диапазон);
	После = ПослеЗаписи[ИндексПоказателяВходящих].Выбрать();

	ЮТест.ОжидаетЧто(После.Следующий(), "итоговый показатель присутствует").ЭтоИстина();
	ИтоговоеКоличество = После.Количество; // Число
	ЮТест.ОжидаетЧто(ИтоговоеКоличество - ИсходноеКоличество,
		"SLA входящих учитывает свой диапазон и превышение 10 минут").Равно(ОжидаемыйПрирост);

КонецПроцедуры
// Проверяет вклад каждого из четырех показателей контроля.
Процедура КонтрольSLA_УчитываетВсеПоказатели() Экспорт

	НачалоСутокМС = 1767225600000;
	Параметры = Новый Структура("ВремяSLAВходящих,ВремяSLAИсходящих", 10, 20);
	Диапазон = Новый Структура("ВхОт,ВхДо,ИсхОт,ИсхДо",
		НачалоСутокМС, НачалоСутокМС + 720000, НачалоСутокМС, НачалоСутокМС + 720000);
	ДоЗаписи = кфкФоновыеОперацииСлужебный.ют_ПоказателиКонтроля(Параметры, Диапазон);

	НоваяЗаписьОчереди(Ложь, НачалоСутокМС + 1000,
		Перечисления.кфкСтатусыСообщений.ОшибкаВыгрузки);
	НоваяЗаписьОчереди(Истина, НачалоСутокМС + 2000,
		Перечисления.кфкСтатусыСообщений.ОшибкаОбработки);

	КлючИсходящего = НоваяЗаписьОчереди(Ложь, НачалоСутокМС + 3000,
		Перечисления.кфкСтатусыСообщений.Выгружено);
	Исходящее = РегистрыСведений.кфкИсходящиеСообщения.СоздатьМенеджерЗаписи();
	Исходящее.КлючЗаписи = КлючИсходящего;
	Исходящее.ДатаРегистрацииМС = НачалоСутокМС + 3000;
	Исходящее.Прочитать();
	Исходящее.ДатаРегистрации = Дата(2026, 1, 1);
	Исходящее.ДатаВыгрузки = Исходящее.ДатаРегистрации + 21 * 60;
	Исходящее.Записать();

	КлючВходящего = НоваяЗаписьОчереди(Истина, НачалоСутокМС + 4000,
		Перечисления.кфкСтатусыСообщений.Обработано);
	Входящее = РегистрыСведений.кфкВходящиеСообщения.СоздатьМенеджерЗаписи();
	Входящее.КлючЗаписи = КлючВходящего;
	Входящее.ДатаЗагрузкиМС = НачалоСутокМС + 4000;
	Входящее.Прочитать();
	Входящее.ДатаЗагрузки = Дата(2026, 1, 1);
	Входящее.ДатаОбработки = Входящее.ДатаЗагрузки + 11 * 60;
	Входящее.Записать();

	ПослеЗаписи = кфкФоновыеОперацииСлужебный.ют_ПоказателиКонтроля(Параметры, Диапазон);
	Для Индекс = 0 По 3 Цикл
		До = ДоЗаписи[Индекс].Выбрать();
		После = ПослеЗаписи[Индекс].Выбрать();
		ЮТест.ОжидаетЧто(До.Следующий(), "начальный показатель " + Индекс).ЭтоИстина();
		ЮТест.ОжидаетЧто(После.Следующий(), "итоговый показатель " + Индекс).ЭтоИстина();
		ЮТест.ОжидаетЧто(После.Количество - До.Количество,
			"прирост показателя " + Индекс).Равно(1);
	КонецЦикла;

КонецПроцедуры
// Проверяет, что повторный контроль не учитывает уже обработанные изменения.
Процедура КонтрольSLA_ПовторНеУчитываетПрежниеОшибки() Экспорт

	Параметры = Новый Структура("ВремяSLAВходящих,ВремяSLAИсходящих", 10, 20);
	кфкФоновыеОперацииСлужебный.ют_КонтрольИнтеграции(Параметры);
	Диапазон = кфкФоновыеОперацииСлужебный.ют_ДиапазонКонтроля();
	МеткаИсходящего = ?(ТипЗнч(Диапазон.ИсхДо) = Тип("Null"), 1, Диапазон.ИсхДо + 1);
	МеткаВходящего = ?(ТипЗнч(Диапазон.ВхДо) = Тип("Null"), 1, Диапазон.ВхДо + 1);

	НоваяЗаписьОчереди(Ложь, МеткаИсходящего,
		Перечисления.кфкСтатусыСообщений.ОшибкаОбработки);
	НоваяЗаписьОчереди(Истина, МеткаВходящего,
		Перечисления.кфкСтатусыСообщений.ОшибкаОбработки);

	ПервыйКонтроль = кфкФоновыеОперацииСлужебный.ют_КонтрольИнтеграции(Параметры);
	ЮТест.ОжидаетЧто(ПервыйКонтроль.ОшибкиИсходящих, "ошибка исходящих").Равно(1);
	ЮТест.ОжидаетЧто(ПервыйКонтроль.ОшибкиВходящих, "ошибка входящих").Равно(1);
	ЮТест.ОжидаетЧто(ПервыйКонтроль.НарушенSLAИсходящих, "SLA исходящих").Равно(0);
	ЮТест.ОжидаетЧто(ПервыйКонтроль.НарушенSLAВходящих, "SLA входящих").Равно(0);

	ПовторныйКонтроль = кфкФоновыеОперацииСлужебный.ют_КонтрольИнтеграции(Параметры);
	ЮТест.ОжидаетЧто(ПовторныйКонтроль.ОшибкиИсходящих, "повтор исходящих").Равно(0);
	ЮТест.ОжидаетЧто(ПовторныйКонтроль.ОшибкиВходящих, "повтор входящих").Равно(0);
	ЮТест.ОжидаетЧто(ПовторныйКонтроль.НарушенSLAИсходящих, "повтор SLA исходящих").Равно(0);
	ЮТест.ОжидаетЧто(ПовторныйКонтроль.НарушенSLAВходящих, "повтор SLA входящих").Равно(0);

КонецПроцедуры
// Проверяет содержание и порядок сообщения контроля при наличии четырех показателей.
Процедура КонтрольSLA_ФормируетСообщениеПоПоказателям() Экспорт

	Параметры = Новый Структура("ВремяSLAВходящих,ВремяSLAИсходящих", 10, 20);
	Показатели = Новый Структура("НарушенSLAИсходящих,НарушенSLAВходящих,ОшибкиИсходящих,ОшибкиВходящих",
		1, 2, 3, 4);
	ТекстСообщения = кфкФоновыеОперацииСлужебный.ют_ТекстКонтроля(Показатели, Параметры);

	ЮТест.ОжидаетЧто(СтрНайти(ТекстСообщения, "Исходящие сообщения"), "исходящая секция").НеРавно(0);
	ЮТест.ОжидаетЧто(СтрНайти(ТекстСообщения, "Входящие сообщения"), "входящая секция").НеРавно(0);
	ЮТест.ОжидаетЧто(СтрНайти(ТекстСообщения, "1 сообщений не завершили обработку или выгрузку более 20 минут"),
		"SLA исходящих в минутах").НеРавно(0);
	ЮТест.ОжидаетЧто(СтрНайти(ТекстСообщения, "2 сообщений не завершили обработку более 10 минут"),
		"SLA входящих в минутах").НеРавно(0);
	ЮТест.ОжидаетЧто(СтрНайти(ТекстСообщения, "3 сообщений завершились с ошибкой"),
		"ошибки исходящих").НеРавно(0);
	ЮТест.ОжидаетЧто(СтрНайти(ТекстСообщения, "4 сообщений завершились с ошибкой"),
		"ошибки входящих").НеРавно(0);
	ЮТест.ОжидаетЧто(
		СтрНайти(ТекстСообщения, "Исходящие сообщения") < СтрНайти(ТекстСообщения, "Входящие сообщения"),
		"порядок направлений").ЭтоИстина();

	ПустыеПоказатели = Новый Структура("НарушенSLAИсходящих,НарушенSLAВходящих,ОшибкиИсходящих,ОшибкиВходящих",
		0, 0, 0, 0);
	ЮТест.ОжидаетЧто(кфкФоновыеОперацииСлужебный.ют_ТекстКонтроля(ПустыеПоказатели, Параметры),
		"пустые показатели не формируют сообщение").Равно("");

КонецПроцедуры

#КонецОбласти

#Область Получение

// Проверяет владельца, статус, метку, занятость, порядок и лимит входящей выборки.
Процедура ВыборкаДесериализации_ОтбираетСвободныеВПорядкеМетки() Экспорт

	СвойКонсьюмер = НовыйКонсьюмер();
	ЧужойКонсьюмер = НовыйКонсьюмер();
	НовыйСтатус = Перечисления.кфкСтатусыСообщений.Новое;
	Первый = НовыйКлюч();
	Второй = НовыйКлюч();
	Третий = НовыйКлюч();
	Ранний = НовыйКлюч();
	Чужой = НовыйКлюч();
	Завершенный = НовыйКлюч();
	Занятый = НовыйКлюч();
	ЗаписатьВходящееДляВыборки(СвойКонсьюмер, Первый, 1000000, НовыйСтатус);
	ЗаписатьВходящееДляВыборки(СвойКонсьюмер, Второй, 1000001, НовыйСтатус);
	ЗаписатьВходящееДляВыборки(СвойКонсьюмер, Третий, 1000002, НовыйСтатус);
	ЗаписатьВходящееДляВыборки(СвойКонсьюмер, Ранний, 999999, НовыйСтатус);
	ЗаписатьВходящееДляВыборки(ЧужойКонсьюмер, Чужой, 1000000, НовыйСтатус);
	ЗаписатьВходящееДляВыборки(СвойКонсьюмер, Завершенный, 1000000,
		Перечисления.кфкСтатусыСообщений.Обработано);
	ЗаписатьВходящееДляВыборки(СвойКонсьюмер, Занятый, 1000000, НовыйСтатус);
	ЗаписатьНазначение(Занятый);
	Консьюмеры = ЮТМетоды.МассивПараметров(СвойКонсьюмер);

	Выборка = кфкФоновыеОперацииСлужебный.ют_ВыборкаДесериализации(
		Консьюмеры, 2, 1000000);
	ЮТест.ОжидаетЧто(КлючиВыборки(Выборка)).Равно(ЮТМетоды.МассивПараметров(Первый, Второй));
	Выборка = кфкФоновыеОперацииСлужебный.ют_ВыборкаДесериализации(
		Консьюмеры, 3, 1000000);
	ЮТест.ОжидаетЧто(КлючиВыборки(Выборка)).Равно(ЮТМетоды.МассивПараметров(Первый, Второй, Третий));
	Для Каждого Ключ Из ЮТМетоды.МассивПараметров(Ранний, Чужой, Завершенный, Занятый) Цикл
		ПроверитьНаличиеЗаписи(Истина, Ключ);
	КонецЦикла;

КонецПроцедуры
// Проверяет связь назначения с полным ключом записи и UUID потока.
Процедура ВыборкаДесериализацииВПотоке_УчитываетКлючДатуИПоток() Экспорт

	Консьюмер = НовыйКонсьюмер();
	НовыйСтатус = Перечисления.кфкСтатусыСообщений.Новое;
	Поток = Новый УникальныйИдентификатор;
	ЧужойПоток = Новый УникальныйИдентификатор;
	Первый = НовыйКлюч();
	Второй = НовыйКлюч();
	Чужой = НовыйКлюч();
	ЗаписатьВходящееДляВыборки(Консьюмер, Первый, 999999, НовыйСтатус);
	ЗаписатьВходящееДляВыборки(Консьюмер, Первый, 1000000, НовыйСтатус);
	ЗаписатьВходящееДляВыборки(Консьюмер, Второй, 1000001, НовыйСтатус);
	ЗаписатьВходящееДляВыборки(Консьюмер, Чужой, 1000000, НовыйСтатус);
	Для Каждого Пара Из ЮТМетоды.МассивПараметров(
		Новый Структура("Ключ,Метка,Поток", Первый, 1000000, Поток),
		Новый Структура("Ключ,Метка,Поток", Второй, 1000001, Поток),
		Новый Структура("Ключ,Метка,Поток", Чужой, 1000000, ЧужойПоток)) Цикл
		Назначение = РегистрыСведений.кфкОчередьПотоков.СоздатьМенеджерЗаписи();
		Назначение.Ключ = Пара.Ключ;
		Назначение.ВременнаяМетка = Пара.Метка;
		Назначение.ИдентификаторПотока = Пара.Поток;
		Назначение.Записать();
	КонецЦикла;

	Выборка = кфкФоновыеОперацииСлужебный.ют_ВыборкаДесериализацииВПотоке(Поток, 1);
	ЮТест.ОжидаетЧто(Выборка.Следующий()).Равно(Истина);
	ЮТест.ОжидаетЧто(Выборка.КлючЗаписи).Равно(Первый);
	ЮТест.ОжидаетЧто(Выборка.ДатаЗагрузкиМС).Равно(1000000);
	ЮТест.ОжидаетЧто(Выборка.Следующий()).Равно(Ложь);
	Выборка = кфкФоновыеОперацииСлужебный.ют_ВыборкаДесериализацииВПотоке(Поток, 2);
	ЮТест.ОжидаетЧто(КлючиВыборки(Выборка)).Равно(ЮТМетоды.МассивПараметров(Первый, Второй));
	ПроверитьНаличиеЗаписи(Истина, Чужой);

КонецПроцедуры
// Проверяет сохранность данных при выполнении операции.
Процедура ДобавитьВходящееСообщениеВОчередь_СохраняетПолезнуюНагрузку() Экспорт

	Сообщение = НовоеСообщение();
	Консьюмер = НовыйКонсьюмер();
	Очередь = РегистрыСведений.кфкВходящиеСообщения.СоздатьНаборЗаписей();
	ДатаЗагрузки = Дата(2026, 1, 2, 3, 4, 5);

	кфкФоновыеОперацииСлужебный.ют_ДобавитьВходящееСообщение(
		Очередь, Консьюмер, Сообщение, ДатаЗагрузки, 1000000, 1);

	ЮТест.ОжидаетЧто(Очередь.Количество()).Равно(1);
	Запись = Очередь[0];
	ЮТест.ОжидаетЧто(Запись.Консьюмер).Равно(Консьюмер);
	ЮТест.ОжидаетЧто(Запись.Топик).Равно(Сообщение.topic);
	ЮТест.ОжидаетЧто(Запись.Раздел).Равно(2);
	ЮТест.ОжидаетЧто(Запись.Смещение).Равно(17);
	ЮТест.ОжидаетЧто(Запись.КлючСообщения).Равно("Ключ-17");
	ЮТест.ОжидаетЧто(Запись.ДатаЗаписи).Равно(МестноеВремя(Дата(1970, 1, 3)));
	ЮТест.ОжидаетЧто(Запись.ДатаЗагрузки).Равно(ДатаЗагрузки);
	ЮТест.ОжидаетЧто(Запись.ДатаЗагрузкиМС).Равно(1000000.0001);
	ЮТест.ОжидаетЧто(Запись.МеткаИзмененияМС).Равно(1000000);
	Тело = кфкОбщегоНазначенияСлужебный.ЗначениеИзХранилища(Запись.ТелоСообщения); // ДвоичныеДанные
	ЮТест.ОжидаетЧто(ТипЗнч(Тело)).Равно(Тип("ДвоичныеДанные"));
	ЮТест.ОжидаетЧто(Base64Строка(Тело)).Равно("AAECf4D/");
	Заголовки = кфкОбщегоНазначенияСлужебный.ЗначениеИзХранилища(Запись.Заголовки); // Соответствие
	ЮТест.ОжидаетЧто(Заголовки.Количество()).Равно(2);
	ЮТест.ОжидаетЧто(Заголовки.Получить("trace-id")).Равно("трасса-17");
	ЮТест.ОжидаетЧто(Заголовки.Получить("content-type")).Равно("application/octet-stream");
	ЮТест.ОжидаетЧто(Запись.Статус).Равно(Перечисления.кфкСтатусыСообщений.Новое);

КонецПроцедуры

// Проверяет сохранность данных при выполнении операции.
Процедура ДобавитьВходящееСообщениеВОчередь_РазличаетПустойИОтсутствующийКлюч() Экспорт

	Сообщение = НовоеСообщение();
	Сообщение.Удалить("key");
	Очередь = РегистрыСведений.кфкВходящиеСообщения.СоздатьНаборЗаписей();
	Консьюмер = НовыйКонсьюмер();

	кфкФоновыеОперацииСлужебный.ют_ДобавитьВходящееСообщение(
		Очередь, Консьюмер, Сообщение, Дата(2026, 1, 1), 1000000, 1);
	Сообщение.Вставить("key", "");
	кфкФоновыеОперацииСлужебный.ют_ДобавитьВходящееСообщение(
		Очередь, Консьюмер, Сообщение, Дата(2026, 1, 1), 1000000, 2);

	ЮТест.ОжидаетЧто(Очередь[0].КлючСообщения).НеРавно("");
	ЮТест.ОжидаетЧто(Очередь[1].КлючСообщения).Равно("");
	ЮТест.ОжидаетЧто(Очередь[0].КлючЗаписи).НеРавно(Очередь[1].КлючЗаписи);

КонецПроцедуры

// Проверяет наличие записи и флаг загрузки после ответа транспорта.
// Параметры:
//  ПустойПакет - Булево
Процедура ОбработчикЗагрузкиПакетСообщений_СогласуетПризнакЗагрузки(ПустойПакет) Экспорт

	Консьюмер = НовыйКонсьюмер();
	Сообщение = НовоеСообщение();
	Сессии = Новый Соответствие;
	ПодготовитьЧтение(Консьюмер, Сообщение, ПустойПакет, Сессии);
	Очередь = РегистрыСведений.кфкВходящиеСообщения.СоздатьНаборЗаписей();
	Консьюмеры = Новый Массив; // Массив Из СправочникСсылка.кфкКонсьюмеры
	Консьюмеры.Добавить(Консьюмер);
	Загружено = Истина;

	кфкФоновыеОперацииСлужебный.ют_ЗагрузитьПакет(Консьюмеры, Сессии, Очередь, 2, Загружено);

	ЮТест.ОжидаетЧто(Загружено).Равно(Не ПустойПакет);
	Предикат = ЮТест.Предикат().Реквизит("Консьюмер").Равно(Консьюмер)
		.Реквизит("Топик").Равно(Сообщение.topic);
	Если ПустойПакет Тогда
		ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкВходящиеСообщения").НеСодержитЗаписи(Предикат);
	Иначе
		ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкВходящиеСообщения").СодержитЗаписи(Предикат);
	КонецЕсли;

КонецПроцедуры

// Проверяет ошибку сохранения после чтения с автофиксацией без сетевого вызова.
Процедура ОбработчикЗагрузкиПакетСообщений_ОшибкаЗаписиНеСохраняетПакет() Экспорт

	Консьюмер = НовыйКонсьюмер();
	Сообщение = НовоеСообщение();
	Сессии = Новый Соответствие;
	ПодготовитьЧтение(Консьюмер, Сообщение, Ложь, Сессии);
	Очередь = РегистрыСведений.кфкВходящиеСообщения.СоздатьНаборЗаписей();
	ЮТест.КонтекстТеста().Вставить("ют_ОчередьОчисткиПослеСбоя", Очередь);
	Очередь.ДополнительныеСвойства.Вставить("ют_ОтказПолучения", Консьюмер);
	Консьюмеры = Новый Массив; // Массив Из СправочникСсылка.кфкКонсьюмеры
	Консьюмеры.Добавить(Консьюмер);
	Загружено = Истина;
	ТекстОшибки = "";

	Попытка
		кфкФоновыеОперацииСлужебный.ют_ЗагрузитьПакет(Консьюмеры, Сессии, Очередь, 2, Загружено);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	ЮТест.ОжидаетЧто(СтрНайти(ТекстОшибки, "Ошибка сохранения входящего пакета для теста") > 0,
		ТекстОшибки).Равно(Истина);

	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкВходящиеСообщения")
		.НеСодержитЗаписи(ЮТест.Предикат().Реквизит("Консьюмер").Равно(Консьюмер));
	ЮТест.ОжидаетЧто(Загружено).Равно(Ложь);
	Мокито.Проверить(кфкИнтеграцияСлужебный)
		.КоличествоВызовов("ПрочитатьПакетСообщений",
			ЮТМетоды.МассивПараметров(Консьюмер, Истина, 2, Сессии))
			.Равно(1);

КонецПроцедуры

#КонецОбласти

#Область Дедупликация

// Проверяет повтор одного сообщения после успешной либо ошибочной обработки.
// Параметры:
//  ПервыйУспешен - Булево
Процедура ОбработатьВходящееСообщение_ХэшПоявляетсяТолькоПослеУспеха(ПервыйУспешен) Экспорт

	Сценарий = НовыйСценарийДедупликации();
	Сценарий.Правило.ИмяМетода = ?(ПервыйУспешен,
		"ОМ_кфкФоновыеОперацииСлужебный_ПолучениеОчистка.ют_УспешнаяДесериализация",
		"ОМ_кфкФоновыеОперацииСлужебный_ПолучениеОчистка.ют_ОшибкаДесериализации");
	Первая = Сценарий.Очередь.Добавить();

	кфкФоновыеОперацииСлужебный.ют_ОбработатьВходящее(
		Сценарий.Выборка, Первая, Сценарий.Правила, Сценарий.Идемпотентные,
		Сценарий.Хэши, Сценарий.Кэш, Сценарий.Момент);

	ОжидаемыйСтатус = ?(ПервыйУспешен, Перечисления.кфкСтатусыСообщений.Обработано,
		Перечисления.кфкСтатусыСообщений.ОшибкаОбработки);
	ЮТест.ОжидаетЧто(Первая.Статус).Равно(ОжидаемыйСтатус);
	ЮТест.ОжидаетЧто(Сценарий.Хэши.Количество()).Равно(?(ПервыйУспешен, 1, 0));
	ЮТест.ОжидаетЧто(Сценарий.Кэш.Количество()).Равно(?(ПервыйУспешен, 1, 0));
	Сценарий.Правило.ИмяМетода = "ОМ_кфкФоновыеОперацииСлужебный_ПолучениеОчистка.ют_УспешнаяДесериализация";
	Вторая = Сценарий.Очередь.Добавить();

	кфкФоновыеОперацииСлужебный.ют_ОбработатьВходящее(
		Сценарий.Выборка, Вторая, Сценарий.Правила, Сценарий.Идемпотентные,
		Сценарий.Хэши, Сценарий.Кэш, Сценарий.Момент);

	ОжидаемыйСтатус = ?(ПервыйУспешен, Перечисления.кфкСтатусыСообщений.ОбработкаОтменена,
		Перечисления.кфкСтатусыСообщений.Обработано);
	ЮТест.ОжидаетЧто(Вторая.Статус).Равно(ОжидаемыйСтатус);
	ЮТест.ОжидаетЧто(Сценарий.Хэши.Количество()).Равно(1);
	ЮТест.ОжидаетЧто(Сценарий.Кэш.Получить(Сценарий.Выборка.КлючЗаписи)).Равно(Сценарий.Хэши[0].ХэшСумма);

КонецПроцедуры

// Проверяет независимое отключение хранилища хэшей и режима консьюмера.
// Параметры:
//  ХранилищеОтключено - Булево
Процедура ОбработатьВходящееСообщение_ОтключеннаяИдемпотентностьНеПодавляетПовтор(ХранилищеОтключено) Экспорт

	Сценарий = НовыйСценарийДедупликации();
	Если ХранилищеОтключено Тогда
		Сценарий.Хэши = Неопределено;
	Иначе
		Сценарий.Идемпотентные.Очистить();
	КонецЕсли;
	Первая = Сценарий.Очередь.Добавить();
	Вторая = Сценарий.Очередь.Добавить();

	кфкФоновыеОперацииСлужебный.ют_ОбработатьВходящее(
		Сценарий.Выборка, Первая, Сценарий.Правила, Сценарий.Идемпотентные,
		Сценарий.Хэши, Сценарий.Кэш, Сценарий.Момент);
	кфкФоновыеОперацииСлужебный.ют_ОбработатьВходящее(
		Сценарий.Выборка, Вторая, Сценарий.Правила, Сценарий.Идемпотентные,
		Сценарий.Хэши, Сценарий.Кэш, Сценарий.Момент);

	ЮТест.ОжидаетЧто(Первая.Статус).Равно(Перечисления.кфкСтатусыСообщений.Обработано);
	ЮТест.ОжидаетЧто(Вторая.Статус).Равно(Перечисления.кфкСтатусыСообщений.Обработано);
	ЮТест.ОжидаетЧто(Сценарий.Кэш.Количество()).Равно(0);

КонецПроцедуры

// Проверяет передачу тела, ключа и заголовков без утечки между входящими сообщениями.
Процедура Десериализация_ДваСообщенияНеСмешиваютСвойства() Экспорт

	Сценарий = НовыйСценарийДедупликации();
	Сценарий.Идемпотентные.Очистить();
	Сценарий.Правило.ИмяМетода =
		"ОМ_кфкФоновыеОперацииСлужебный_ПолучениеОчистка.ют_ДесериализацияДвухСообщений";
	Первый = Сценарий.Выборка.КлючЗаписи;
	Второй = НовыйКлюч();
	Ключи = ЮТМетоды.МассивПараметров(Первый, Второй);
	Тела = ЮТМетоды.МассивПараметров("тело-первое", "тело-второе");
	КлючиСообщений = ЮТМетоды.МассивПараметров("key-1", "key-2");
	ЗаголовкиСообщений = ЮТМетоды.МассивПараметров("trace-1", "trace-2");
	Поток = Новый УникальныйИдентификатор;
	Для Индекс = 0 По 1 Цикл
		Запись = РегистрыСведений.кфкВходящиеСообщения.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Сценарий.Выборка);
		Запись.КлючЗаписи = Ключи[Индекс];
		Запись.ДатаЗагрузкиМС = 1000000 + Индекс;
		Запись.Статус = Перечисления.кфкСтатусыСообщений.Новое;
		Запись.ТелоСообщения = кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище(Тела[Индекс]);
		Запись.КлючСообщения = КлючиСообщений[Индекс];
		Заголовки = Новый Соответствие; // Соответствие Из Строка
		Заголовки.Вставить("trace-id", ЗаголовкиСообщений[Индекс]);
		Запись.Заголовки = кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище(Заголовки);
		Запись.Записать();
		Назначение = РегистрыСведений.кфкОчередьПотоков.СоздатьМенеджерЗаписи();
		Назначение.Ключ = Ключи[Индекс];
		Назначение.ВременнаяМетка = 1000000 + Индекс;
		Назначение.ИдентификаторПотока = Поток;
		Назначение.Записать();
	КонецЦикла;

	История = Новый Массив; // Массив Из Структура
	ЮТест.КонтекстТеста().Вставить("ют_ИсторияДесериализации", История);
	Очереди = Новый Структура;
	Очереди.Вставить("Очередь", Сценарий.Очередь);
	Очереди.Вставить("ОчередьПотока", РегистрыСведений.кфкОчередьПотоков.СоздатьНаборЗаписей());
	Выборка = кфкФоновыеОперацииСлужебный.ют_ВыборкаДесериализацииВПотоке(Поток, 2);

	кфкФоновыеОперацииСлужебный.ют_ОбработатьПакетВходящих(
		Выборка, Очереди, Поток, Сценарий.Правила, Сценарий.Идемпотентные, Сценарий.Хэши);

	ЮТест.ОжидаетЧто(История).ИмеетДлину(2);
	ЮТест.ОжидаетЧто(История[0].Тело).Равно("тело-первое");
	ЮТест.ОжидаетЧто(История[0].Ключ).Равно("key-1");
	ЮТест.ОжидаетЧто(История[0].Заголовок).Равно("trace-1");
	ЮТест.ОжидаетЧто(История[1].Тело).Равно("тело-второе");
	ЮТест.ОжидаетЧто(История[1].Ключ).Равно("key-2");
	ЮТест.ОжидаетЧто(История[1].Заголовок).Равно("trace-2");
	ЮТест.ОжидаетЧто(История[1].Утечка).Равно(Неопределено);
	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкВходящиеСообщения")
		.СодержитЗаписи(ЮТест.Предикат().Реквизит("КлючЗаписи").Равно(Первый)
			.Реквизит("Статус").Равно(Перечисления.кфкСтатусыСообщений.Обработано));
	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкВходящиеСообщения")
		.СодержитЗаписи(ЮТест.Предикат().Реквизит("КлючЗаписи").Равно(Второй)
			.Реквизит("Статус").Равно(Перечисления.кфкСтатусыСообщений.ОбработкаОтменена));

КонецПроцедуры
// Проверяет сохранность данных при выполнении операции.
Процедура ОбработчикДесериализацииСообщений_СохраняетХэшИПодавляетСледующийПакет() Экспорт

	Сценарий = НовыйСценарийДедупликации();
	Запись = РегистрыСведений.кфкВходящиеСообщения.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, Сценарий.Выборка);
	Запись.ДатаЗагрузкиМС = 1000000;
	Запись.Статус = Перечисления.кфкСтатусыСообщений.Новое;
	Запись.Записать();
	Очереди = Новый Структура;
	Очереди.Вставить("Очередь", Сценарий.Очередь);
	Очереди.Вставить("ОчередьПотока", РегистрыСведений.кфкОчередьПотоков.СоздатьНаборЗаписей());
	Поток = Новый УникальныйИдентификатор;
	Выборка = ВыборкаСобственногоВходящего(Сценарий.Выборка.КлючЗаписи, 1000000);

	кфкФоновыеОперацииСлужебный.ют_ОбработатьПакетВходящих(
		Выборка, Очереди, Поток, Сценарий.Правила, Сценарий.Идемпотентные, Сценарий.Хэши);

	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкХэшСуммыСообщений")
		.СодержитЗаписи(ЮТест.Предикат().Реквизит("КлючЗаписи").Равно(Сценарий.Выборка.КлючЗаписи));
	Запись.ДатаЗагрузкиМС = 2000000;
	Запись.Записать();
	Выборка = ВыборкаСобственногоВходящего(Сценарий.Выборка.КлючЗаписи, 2000000);

	кфкФоновыеОперацииСлужебный.ют_ОбработатьПакетВходящих(
		Выборка, Очереди, Поток, Сценарий.Правила, Сценарий.Идемпотентные, Сценарий.Хэши);

	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкВходящиеСообщения")
		.СодержитЗаписи(ЮТест.Предикат()
			.Реквизит("КлючЗаписи").Равно(Сценарий.Выборка.КлючЗаписи)
			.Реквизит("ДатаЗагрузкиМС").Равно(2000000)
			.Реквизит("Статус").Равно(Перечисления.кфкСтатусыСообщений.ОбработкаОтменена));

КонецПроцедуры

#КонецОбласти

#Область Повторы

// Проверяет строгие границы позиции и числа отправок.
// Параметры:
//  СмещениеМетки - Число
//  Попытки - Число
//  Ожидается - Булево
Процедура ВыборкаВозвратаВОчередь_ПроверяетГраницуИПопытки(СмещениеМетки, Попытки, Ожидается) Экспорт

	Ключ = НовыйКлюч();
	ЗаписатьИсходящее(Ключ, 1000000 + СмещениеМетки,
		Перечисления.кфкСтатусыСообщений.ОшибкаВыгрузки, Попытки);

	Выборка = кфкФоновыеОперацииСлужебный.ют_ВыборкаВозврата(1000, 1000000, 3);
	Ключи = КлючиВыборки(Выборка);

	ЮТест.ОжидаетЧто(Ключи.Найти(Ключ) <> Неопределено).Равно(Ожидается);
	ПроверитьНаличиеЗаписи(Ложь, Ключ);

КонецПроцедуры

// Проверяет сохранность данных при выполнении операции.
Процедура ВыборкаВозвратаВОчередь_НеВозвращаетУспешныеСообщения() Экспорт

	Ключ = НоваяЗаписьОчереди(Ложь, 1000001, Перечисления.кфкСтатусыСообщений.Выгружено);

	Ключи = КлючиВыборки(кфкФоновыеОперацииСлужебный.ют_ВыборкаВозврата(1000, 1000000, 3));

	ЮТест.ОжидаетЧто(Ключи.Найти(Ключ)).Равно(Неопределено);
	ПроверитьНаличиеЗаписи(Ложь, Ключ);

КонецПроцедуры

// Проверяет допуск занятого ключа к возврату без изменения исходящей записи.
// Занятость ключа проверяется позже, при выборке на отправку.
Процедура ВыборкаВозвратаВОчередь_СохраняетЗанятыйКлюч() Экспорт

	Ключ = НоваяЗаписьОчереди(Ложь, 1000001, Перечисления.кфкСтатусыСообщений.ОшибкаВыгрузки);
	ЗаписатьНазначение(Ключ);

	Ключи = КлючиВыборки(кфкФоновыеОперацииСлужебный.ют_ВыборкаВозврата(1000, 1000000, 3));

	ЮТест.ОжидаетЧто(Ключи.Найти(Ключ), "Занятый ключ допускается в выборку возврата")
		.НеРавно(Неопределено);
	ПроверитьНаличиеЗаписи(Ложь, Ключ);

КонецПроцедуры
// Проверяет допуск старой ошибки к возврату без изменения новой регистрации.
// Актуальность регистрации проверяется позже, при выборке на отправку.
Процедура ВыборкаВозвратаВОчередь_СохраняетНовуюРегистрацию() Экспорт

	Ключ = НовыйКлюч();
	ЗаписатьИсходящее(Ключ, 1000001, Перечисления.кфкСтатусыСообщений.ОшибкаВыгрузки);
	ЗаписатьИсходящее(Ключ, 1000002, Перечисления.кфкСтатусыСообщений.Новое);

	Ключи = КлючиВыборки(кфкФоновыеОперацииСлужебный.ют_ВыборкаВозврата(1000, 1000000, 3));

	ЮТест.ОжидаетЧто(Ключи.Найти(Ключ), "Старая ошибка допускается в выборку возврата")
		.НеРавно(Неопределено);
	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкИсходящиеСообщения")
		.СодержитЗаписи(ЮТест.Предикат().Реквизит("КлючЗаписи").Равно(Ключ)
			.Реквизит("ДатаРегистрацииМС").Равно(1000002)
			.Реквизит("Статус").Равно(Перечисления.кфкСтатусыСообщений.Новое));

КонецПроцедуры
// Проверяет порядок повторов и границу размера порции.
Процедура ВыборкаВозвратаВОчередь_ОграничиваетПорциюВПорядкеМетки() Экспорт

	Первая = НоваяЗаписьОчереди(Ложь, 1000001, Перечисления.кфкСтатусыСообщений.ОшибкаВыгрузки);
	Вторая = НоваяЗаписьОчереди(Ложь, 1000002, Перечисления.кфкСтатусыСообщений.ОшибкаВыгрузки);
	Хвост = НоваяЗаписьОчереди(Ложь, 1000003, Перечисления.кфкСтатусыСообщений.ОшибкаВыгрузки);

	Ключи = КлючиВыборки(кфкФоновыеОперацииСлужебный.ют_ВыборкаВозврата(2, 1000000, 3));

	ЮТест.ОжидаетЧто(Ключи.Количество()).Равно(2);
	ЮТест.ОжидаетЧто(Ключи[0]).Равно(Первая);
	ЮТест.ОжидаетЧто(Ключи[1]).Равно(Вторая);
	ПроверитьНаличиеЗаписи(Ложь, Хвост);

КонецПроцедуры

// Проверяет сохранение новой регистрации и всех назначенных сообщений.
// Параметры:
//  Занят - Булево
Процедура ВыборкаДублейИсходящихСообщений_УчитываетЗанятостьИНовуюРегистрацию(Занят) Экспорт

	Ключ = НовыйКлюч();
	ЗаписатьИсходящее(Ключ, 1000000, Перечисления.кфкСтатусыСообщений.Новое);
	ЗаписатьИсходящее(Ключ, 1000001, Перечисления.кфкСтатусыСообщений.Новое);
	Если Занят Тогда
		ЗаписатьНазначение(Ключ);
	КонецЕсли;

	Выборка = кфкФоновыеОперацииСлужебный.ют_ВыборкаДублей(1000, 1000000);
	НайденаСтарая = Ложь;
	НайденаНовая = Ложь;
	Пока Выборка.Следующий() Цикл
		Если Выборка.КлючЗаписи = Ключ Тогда
			НайденаСтарая = НайденаСтарая Или Выборка.ДатаРегистрацииМС = 1000000;
			НайденаНовая = НайденаНовая Или Выборка.ДатаРегистрацииМС = 1000001;
		КонецЕсли;
	КонецЦикла;

	ЮТест.ОжидаетЧто(НайденаСтарая).Равно(Не Занят);
	ЮТест.ОжидаетЧто(НайденаНовая).Равно(Ложь);
	ПроверитьНаличиеЗаписи(Ложь, Ключ);

КонецПроцедуры

// Проверяет включающую границу дублей и допустимые статусы.
// Параметры:
//  СмещениеМетки - Число
//  ИмяСтатуса - Строка
//  Ожидается - Булево
Процедура ВыборкаДублейИсходящихСообщений_СоблюдаетГраницуИСтатус(СмещениеМетки, ИмяСтатуса, Ожидается) Экспорт

	Ключ = НовыйКлюч();
	ЗаписатьИсходящее(Ключ, 1000000 + СмещениеМетки, Перечисления.кфкСтатусыСообщений[ИмяСтатуса]);
	ЗаписатьИсходящее(Ключ, 2000000, Перечисления.кфкСтатусыСообщений.Выгружено);

	Ключи = КлючиВыборки(кфкФоновыеОперацииСлужебный.ют_ВыборкаДублей(1000, 1000000));

	ЮТест.ОжидаетЧто(Ключи.Найти(Ключ) <> Неопределено).Равно(Ожидается);

КонецПроцедуры

// Проверяет сохранность данных при выполнении операции.
Процедура ОбработатьВыборкуДублей_ОтменяетТолькоСтаруюРегистрацию() Экспорт

	Ключ = НовыйКлюч();
	ЗаписатьИсходящее(Ключ, 1000000, Перечисления.кфкСтатусыСообщений.Новое);
	ЗаписатьИсходящее(Ключ, 2000000, Перечисления.кфкСтатусыСообщений.Новое);
	ЧужойКлюч = НоваяЗаписьОчереди(Ложь, 1000001, Перечисления.кфкСтатусыСообщений.Выгружено);
	Выборка = кфкФоновыеОперацииСлужебный.ют_ВыборкаДублей(1000, 1000000);
	Очередь = РегистрыСведений.кфкИсходящиеСообщения.СоздатьНаборЗаписей();
	Позиция = 1000000;

	кфкФоновыеОперацииСлужебный.ют_ОбработатьДубли(Выборка, Очередь, 2, 900000, Позиция);

	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкИсходящиеСообщения")
		.СодержитЗаписи(ЮТест.Предикат()
			.Реквизит("КлючЗаписи").Равно(Ключ)
			.Реквизит("ДатаРегистрацииМС").Равно(1000000)
			.Реквизит("Статус").Равно(Перечисления.кфкСтатусыСообщений.ОбработкаОтменена));
	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкИсходящиеСообщения")
		.СодержитЗаписи(ЮТест.Предикат()
			.Реквизит("КлючЗаписи").Равно(Ключ)
			.Реквизит("ДатаРегистрацииМС").Равно(2000000)
			.Реквизит("Статус").Равно(Перечисления.кфкСтатусыСообщений.Новое));
	ПроверитьНаличиеЗаписи(Ложь, ЧужойКлюч);

КонецПроцедуры

#КонецОбласти

#Область Очистка

// Проверяет отключение очистки и ожидание логов.
//
// Параметры:
//  Срок - Число
//  Логи - Число, Неопределено
//  ОжидаемаяПозиция - Число, Неопределено
Процедура РассчитатьУказательУдаления_УчитываетРежим(Срок, Логи, ОжидаемаяПозиция) Экспорт

	ПроверитьРасчетУдаления(Срок, Логи, ОжидаемаяПозиция);

КонецПроцедуры

// Проверяет нулевой, положительный и дробный сроки и минимум с позицией логов.
//
// Параметры:
//  Срок - Число
//  Логи - Число, Неопределено
//  ОжидаемаяПозиция - Число
Процедура РассчитатьУказательУдаления_СоблюдаетВременнуюГраницу(Срок, Логи, ОжидаемаяПозиция) Экспорт

	ПроверитьРасчетУдаления(Срок, Логи, ОжидаемаяПозиция);

КонецПроцедуры

// Проверяет сохранность данных при выполнении операции.
Процедура РассчитатьУказательУдаления_ОтклоняетНекорректныйСрок() Экспорт

	ЮТест.ОжидаетЧто(кфкФоновыеОперацииСлужебный)
		.Метод("ют_РассчитатьУказательУдаления", ЮТМетоды.МассивПараметров(172800000, -3))
			.ВыбрасываетИсключение("Некорректный срок хранения");

КонецПроцедуры
// Проверяет строгую границу очистки сохраненных хэшей.
Процедура ВыборкаХэшСуммыСообщений_СохраняетГраничныеЗаписи() Экспорт

	КлючДо = НовыйКлюч();
	КлючНа = НовыйКлюч();
	После = НовыйКлюч();
	ЗаписатьХэш(КлючДо, 999999);
	ЗаписатьХэш(КлючНа, 1000000);
	ЗаписатьХэш(После, 1000001);

	Ключи = КлючиВыборки(кфкФоновыеОперацииСлужебный.ют_ВыборкаХэшСумм(1000000));

	ЮТест.ОжидаетЧто(Ключи.Найти(КлючДо)).НеРавно(Неопределено);
	ЮТест.ОжидаетЧто(Ключи.Найти(КлючНа)).Равно(Неопределено);
	ЮТест.ОжидаетЧто(Ключи.Найти(После)).Равно(Неопределено);
	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкХэшСуммыСообщений")
		.СодержитЗаписи(ЮТест.Предикат().Реквизит("КлючЗаписи").Равно(После));

КонецПроцедуры

// Проверяет удаление только до порога нужного направления.
// Параметры:
//  Входящие - Булево
Процедура ВыборкаУстаревшихСообщений_СохраняетГраницуИЧужойСтатус(Входящие) Экспорт

	Параметры = НовыеПараметрыОчистки();
	ЗаписатьПозицииЛогов();
	Если Входящие Тогда
		Параметры.СрокХраненияОбработанных = -2;
		Порог = 2000000;
		Статус = Перечисления.кфкСтатусыСообщений.Обработано;
	Иначе
		Параметры.СрокХраненияОтправленных = -2;
		Порог = 1000000;
		Статус = Перечисления.кфкСтатусыСообщений.Выгружено;
	КонецЕсли;
	ДоПорога = НоваяЗаписьОчереди(Входящие, Порог - 1, Статус);
	НаПороге = НоваяЗаписьОчереди(Входящие, Порог, Статус);
	ПослеПорога = НоваяЗаписьОчереди(Входящие, Порог + 1, Статус);
	Незавершенная = НоваяЗаписьОчереди(Входящие, Порог - 2, Перечисления.кфкСтатусыСообщений.Новое);
	ЧужойСтатус = НоваяЗаписьОчереди(Входящие, Порог - 3, Перечисления.кфкСтатусыСообщений.ОшибкаОбработки);

	Выборка = ВыборкаОчистки(Входящие, Параметры, 1000);
	Ключи = КлючиВыборки(Выборка);
	ЮТест.ОжидаетЧто(Ключи.Найти(ДоПорога)).НеРавно(Неопределено);
	ЮТест.ОжидаетЧто(Ключи.Найти(НаПороге)).Равно(Неопределено);
	ЮТест.ОжидаетЧто(Ключи.Найти(ПослеПорога)).Равно(Неопределено);
	ЮТест.ОжидаетЧто(Ключи.Найти(Незавершенная)).Равно(Неопределено);
	ЮТест.ОжидаетЧто(Ключи.Найти(ЧужойСтатус)).Равно(Неопределено);

	ПроверитьНаличиеЗаписи(Входящие, НаПороге);
	ПроверитьНаличиеЗаписи(Входящие, ПослеПорога);
	ПроверитьНаличиеЗаписи(Входящие, Незавершенная);
	ПроверитьНаличиеЗаписи(Входящие, ЧужойСтатус);

КонецПроцедуры

// Проверяет удаление полного пакета и последнего остатка.
// Параметры:
//  Входящие - Булево
Процедура УдалитьЗаписиРС_УдаляетПолныйПакетИХвост(Входящие) Экспорт

	Параметры = НовыеПараметрыОчистки();
	ЗаписатьПозицииЛогов();
	Если Входящие Тогда
		Параметры.СрокХраненияОбработанных = -2;
		Менеджер = РегистрыСведений.кфкВходящиеСообщения;
		Статус = Перечисления.кфкСтатусыСообщений.Обработано;
	Иначе
		Параметры.СрокХраненияОтправленных = -2;
		Менеджер = РегистрыСведений.кфкИсходящиеСообщения;
		Статус = Перечисления.кфкСтатусыСообщений.Выгружено;
	КонецЕсли;
	Первый = НоваяЗаписьОчереди(Входящие, 100, Статус);
	Второй = НоваяЗаписьОчереди(Входящие, 200, Статус);
	Хвост = НоваяЗаписьОчереди(Входящие, 300, Статус);
	Контроль = НоваяЗаписьОчереди(Входящие, 3000000, Статус);
	Выборка = ВыборкаОчистки(Входящие, Параметры, 3);

	кфкФоновыеОперацииСлужебный.ют_УдалитьЗаписи(Выборка, Менеджер, 2);

	ПроверитьОтсутствиеЗаписи(Входящие, Первый);
	ПроверитьОтсутствиеЗаписи(Входящие, Второй);
	ПроверитьНаличиеЗаписи(Входящие, Хвост);

	кфкФоновыеОперацииСлужебный.ют_УдалитьЗаписи(Выборка, Менеджер, 2);

	ПроверитьОтсутствиеЗаписи(Входящие, Хвост);
	ПроверитьНаличиеЗаписи(Входящие, Контроль);

КонецПроцедуры

// Проверяет полное отключение удаления для всех статусов.
// Параметры:
//  Входящие - Булево
Процедура ВыборкаУстаревшихСообщений_ОтключенныйСрокСохраняетДанные(Входящие) Экспорт

	Параметры = НовыеПараметрыОчистки();
	Ключ = НоваяЗаписьОчереди(Входящие, 10, Перечисления.кфкСтатусыСообщений.Обработано);

	Выборка = ВыборкаОчистки(Входящие, Параметры, 1000);

	ЮТест.ОжидаетЧто(Выборка.Количество()).Равно(0);
	ПроверитьНаличиеЗаписи(Входящие, Ключ);

КонецПроцедуры
// Проверяет применение отдельного срока к своему статусу.
// Параметры:
//  Входящие - Булево
//  ИмяСрока - Строка
//  ИмяСтатуса - Строка
Процедура ВыборкаУстаревшихСообщений_ПрименяетСрокКСвоемуСтатусу(Входящие, ИмяСрока, ИмяСтатуса) Экспорт

	Параметры = НовыеПараметрыОчистки();
	Параметры[ИмяСрока] = -2;
	ЗаписатьПозицииЛогов();
	Порог = ?(Входящие, 2000000, 1000000);
	Статус = Перечисления.кфкСтатусыСообщений[ИмяСтатуса];
	Удаляемая = НоваяЗаписьОчереди(Входящие, Порог - 1, Статус);
	Граничная = НоваяЗаписьОчереди(Входящие, Порог, Статус);

	Выборка = ВыборкаОчистки(Входящие, Параметры, 1000);
	Ключи = КлючиВыборки(Выборка);

	ЮТест.ОжидаетЧто(Ключи.Найти(Удаляемая)).НеРавно(Неопределено);
	ЮТест.ОжидаетЧто(Ключи.Найти(Граничная)).Равно(Неопределено);
	ПроверитьНаличиеЗаписи(Входящие, Граничная);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиТестов

// Сохраняет фактически переданные данные двух сообщений и проверяет изоляцию заголовков.
// Параметры:
//  Тело - Строка
//  Свойства - Структура
//  Журнал - Строка
//  Отказ - Булево
Процедура ют_ДесериализацияДвухСообщений(Тело, Свойства, Журнал, Отказ) Экспорт

	История = ЮТест.КонтекстТеста().ют_ИсторияДесериализации; // Массив Из Структура
	Снимок = Новый Структура;
	Снимок.Вставить("Тело", Тело);
	Снимок.Вставить("Ключ", Свойства.Ключ);
	Снимок.Вставить("Топик", Свойства.Топик);
	Снимок.Вставить("Заголовок", Свойства.Заголовки.Получить("trace-id"));
	Снимок.Вставить("Утечка", Свойства.Заголовки.Получить("only-first"));
	История.Добавить(Снимок);
	Если История.Количество() = 1 Тогда
		Свойства.Заголовки.Вставить("only-first", "не переносить");
		Журнал = "Первое сообщение";
		Отказ = Ложь;
	Иначе
		Журнал = "Второе сообщение";
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры
// Реализует успешную внешнюю десериализацию тестового сообщения.
// Параметры:
//  Тело - Строка
//  Свойства - Структура
//  Журнал - Строка
//  Отказ - Булево
Процедура ют_УспешнаяДесериализация(Тело, Свойства, Журнал, Отказ) Экспорт

	ЮТест.ОжидаетЧто(Тело).Равно("payload");
	ЮТест.ОжидаетЧто(Свойства.Топик).Равно("unit-dedup");
	Журнал = "Успешная обработка";
	Отказ = Ложь;

КонецПроцедуры

// Реализует отказ внешнего обработчика до сохранения хэша.
// Параметры:
//  Тело - Строка
//  Свойства - Структура
//  Журнал - Строка
//  Отказ - Булево
Процедура ют_ОшибкаДесериализации(Тело, Свойства, Журнал, Отказ) Экспорт

	Журнал = Тело + ":" + Свойства.Топик;
	Отказ = Ложь;
	ВызватьИсключение "Ошибка внешнего обработчика для теста";

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет рассчитанное значение по независимому эталону.
// Параметры:
//  Срок - Число
//  Логи - Число, Неопределено
//  Ожидаемое - Число, Неопределено
Процедура ПроверитьРасчетУдаления(Срок, Логи, Ожидаемое)

	Результат = кфкФоновыеОперацииСлужебный.ют_РассчитатьУказательУдаления(172800000, Срок, Логи);
	ЮТест.ОжидаетЧто(Результат).Равно(Ожидаемое);

КонецПроцедуры

// Возвращает уникальный ключ сообщения.
// Возвращаемое значение:
//  Строка
Функция НовыйКлюч()

	Возврат Строка(Новый УникальныйИдентификатор);

КонецФункции

// Возвращает собственную ссылку консьюмера.
// Возвращаемое значение:
//  СправочникСсылка.кфкКонсьюмеры
Функция НовыйКонсьюмер()

	Возврат ЮТест.Данные().КонструкторОбъекта(Справочники.кфкКонсьюмеры)
		.Установить("Наименование", "Проверка получения " + НовыйКлюч())
		.Установить("Брокер", кфк_т_ТестовыеДанные.СсылкаБрокераПоУмолчанию())
		.Записать(Ложь, Истина);

КонецФункции

// Возвращает параметры полностью отключенной очистки.
// Возвращаемое значение:
//  Структура:
//   * СрокХраненияНезавершенных - Число
//   * СрокХраненияОшибкиОбработкиИсходящих - Число
//   * СрокХраненияОтмененныхИсходящих - Число
//   * СрокХраненияОшибкиОтправки - Число
//   * СрокХраненияОтправленных - Число
//   * СрокХраненияОшибкиОбработкиВходящих - Число
//   * СрокХраненияОтмененныхВходящих - Число
//   * СрокХраненияОбработанных - Число
//   * УчитыватьУказательЛогирования - Булево
Функция НовыеПараметрыОчистки()

	Результат = Новый Структура;
	Результат.Вставить("СрокХраненияНезавершенных", -1);
	Результат.Вставить("СрокХраненияОшибкиОбработкиИсходящих", -1);
	Результат.Вставить("СрокХраненияОтмененныхИсходящих", -1);
	Результат.Вставить("СрокХраненияОшибкиОтправки", -1);
	Результат.Вставить("СрокХраненияОтправленных", -1);
	Результат.Вставить("СрокХраненияОшибкиОбработкиВходящих", -1);
	Результат.Вставить("СрокХраненияОтмененныхВходящих", -1);
	Результат.Вставить("СрокХраненияОбработанных", -1);
	Результат.Вставить("УчитыватьУказательЛогирования", Истина);
	Возврат Результат;

КонецФункции

Процедура ЗаписатьПозицииЛогов()

	ЗаписатьПозицию("00000000-0001-0000-0000-111111111111", 1000000);
	ЗаписатьПозицию("00000000-0001-0000-0000-222222222222", 2000000);
	ЗаписатьПозицию("00000000-0003-0000-0000-777777777777", 3000000);

КонецПроцедуры

// Параметры:
//  Идентификатор - Строка
//  Позиция - Число
Процедура ЗаписатьПозицию(Идентификатор, Позиция)

	Запись = РегистрыСведений.кфкПозицииОпераций.СоздатьМенеджерЗаписи();
	Запись.Идентификатор = Новый УникальныйИдентификатор(Идентификатор);
	Запись.ВременнаяМетка = Позиция;
	Запись.Записать();

КонецПроцедуры
// Параметры:
//  Ключ - Строка
//  Метка - Число
Процедура ЗаписатьХэш(Ключ, Метка)

	Запись = РегистрыСведений.кфкХэшСуммыСообщений.СоздатьМенеджерЗаписи();
	Запись.КлючЗаписи = Ключ;
	Запись.ХэшСумма = "0123456789abcdef";
	Запись.МеткаИзмененияМС = Метка;
	Запись.ДатаОбновления = Дата(2026, 1, 1);
	Запись.Записать();

КонецПроцедуры

// Создаёт входящую запись с явными ключом, владельцем, статусом и меткой.
// Параметры:
//  Консьюмер - СправочникСсылка.кфкКонсьюмеры
//  Ключ - Строка
//  Метка - Число
//  Статус - ПеречислениеСсылка.кфкСтатусыСообщений
Процедура ЗаписатьВходящееДляВыборки(Консьюмер, Ключ, Метка, Статус)

	Запись = РегистрыСведений.кфкВходящиеСообщения.СоздатьМенеджерЗаписи();
	Запись.КлючЗаписи = Ключ;
	Запись.Консьюмер = Консьюмер;
	Запись.ДатаЗагрузкиМС = Метка;
	Запись.МеткаИзмененияМС = Метка;
	Запись.Статус = Статус;
	Запись.Записать();

КонецПроцедуры
// Возвращает ключ собственной записи очереди.
// Параметры:
//  Входящие - Булево
//  Метка - Число
//  Статус - ПеречислениеСсылка.кфкСтатусыСообщений
// Возвращаемое значение:
//  Строка
Функция НоваяЗаписьОчереди(Входящие, Метка, Статус)

	Ключ = НовыйКлюч();
	Если Входящие Тогда
		Запись = РегистрыСведений.кфкВходящиеСообщения.СоздатьМенеджерЗаписи();
		Запись.КлючЗаписи = Ключ;
		Запись.ДатаЗагрузкиМС = Метка;
		Запись.МеткаИзмененияМС = Метка;
		Запись.Статус = Статус;
		Запись.Записать();
	Иначе
		ЗаписатьИсходящее(Ключ, Метка, Статус);
	КонецЕсли;
	Возврат Ключ;

КонецФункции

// Параметры:
//  Ключ - Строка
//  Метка - Число
//  Статус - ПеречислениеСсылка.кфкСтатусыСообщений
//  Попытки - Число
Процедура ЗаписатьИсходящее(Ключ, Метка, Статус, Попытки = 0)

	Запись = РегистрыСведений.кфкИсходящиеСообщения.СоздатьМенеджерЗаписи();
	Запись.КлючЗаписи = Ключ;
	Запись.ДатаРегистрацииМС = Метка;
	Запись.МеткаИзмененияМС = Метка;
	Запись.Статус = Статус;
	Запись.КоличествоВыгрузок = Попытки;
	Запись.Записать();

КонецПроцедуры

// Параметры:
//  Ключ - Строка
Процедура ЗаписатьНазначение(Ключ)

	Запись = РегистрыСведений.кфкОчередьПотоков.СоздатьМенеджерЗаписи();
	Запись.Ключ = Ключ;
	Запись.ИдентификаторПотока = Новый УникальныйИдентификатор;
	Запись.ВременнаяМетка = 1000001;
	Запись.Записать();

КонецПроцедуры

// Возвращает исходную выборку очистки нужного направления.
// Параметры:
//  Входящие - Булево
//  Параметры - см. НовыеПараметрыОчистки
//  Лимит - Число
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - записи.
//  Массив - пустой результат.
Функция ВыборкаОчистки(Входящие, Параметры, Лимит)

	Если Входящие Тогда
		Возврат кфкФоновыеОперацииСлужебный.ют_УстаревшиеВходящие(Параметры, Лимит);
	КонецЕсли;
	Возврат кфкФоновыеОперацииСлужебный.ют_УстаревшиеИсходящие(Параметры, Лимит);

КонецФункции

// Возвращает ключи результата проверяемого SQL API.
// Параметры:
//  Выборка - ВыборкаИзРезультатаЗапроса
// Возвращаемое значение:
//  Массив Из Строка
Функция КлючиВыборки(Выборка)

	Результат = Новый Массив; // Массив Из Строка
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.КлючЗаписи);
	КонецЦикла;
	Возврат Результат;

КонецФункции

// Параметры:
//  Входящие - Булево
//  Ключ - Строка
Процедура ПроверитьНаличиеЗаписи(Входящие, Ключ)

	ИмяТаблицы = ?(Входящие, "РегистрСведений.кфкВходящиеСообщения", "РегистрСведений.кфкИсходящиеСообщения");
	ЮТест.ОжидаетЧтоТаблицаБазы(ИмяТаблицы)
		.СодержитЗаписи(ЮТест.Предикат().Реквизит("КлючЗаписи").Равно(Ключ));

КонецПроцедуры

// Параметры:
//  Входящие - Булево
//  Ключ - Строка
Процедура ПроверитьОтсутствиеЗаписи(Входящие, Ключ)

	ИмяТаблицы = ?(Входящие, "РегистрСведений.кфкВходящиеСообщения", "РегистрСведений.кфкИсходящиеСообщения");
	ЮТест.ОжидаетЧтоТаблицаБазы(ИмяТаблицы)
		.НеСодержитЗаписи(ЮТест.Предикат().Реквизит("КлючЗаписи").Равно(Ключ));

КонецПроцедуры

// Возвращает транспортный пакет с явными контрольными значениями.
// Возвращаемое значение:
//  Структура:
//   * topic - Строка
//   * partition - Число
//   * offset - Число
//   * timestamp - Число
//   * message - ДвоичныеДанные
//   * headers - Массив Из Структура
//   * key - Строка
Функция НовоеСообщение()

	Заголовки = Новый Массив; // Массив Из Структура
	Заголовки.Добавить(Новый Структура("key,value", "trace-id", "трасса-17"));
	Заголовки.Добавить(Новый Структура("key,value", "content-type", "application/octet-stream"));
	Результат = Новый Структура;
	Результат.Вставить("topic", "unit-receive-" + НовыйКлюч());
	Результат.Вставить("partition", 2);
	Результат.Вставить("offset", 17);
	Результат.Вставить("timestamp", 172800000);
	Результат.Вставить("message", Base64Значение("AAECf4D/"));
	Результат.Вставить("headers", Заголовки);
	Результат.Вставить("key", "Ключ-17");
	Возврат Результат;

КонецФункции

// Настраивает единственный ответ внешнего чтения; автофиксация обязательна.
// Параметры:
//  Консьюмер - СправочникСсылка.кфкКонсьюмеры
//  Сообщение - см. НовоеСообщение
//  ПустойПакет - Булево
//  Сессии - Соответствие Из КлючИЗначение
Процедура ПодготовитьЧтение(Консьюмер, Сообщение, ПустойПакет, Сессии)

	Сообщения = Новый Массив; // Массив Из Структура
	Если Не ПустойПакет Тогда
		Сообщения.Добавить(Сообщение);
	КонецЕсли;
	Ответ = Новый Структура("Успешно,ТекстОшибки,Сообщения", Истина, "", Сообщения);
	Мокито.Обучение(кфкИнтеграцияСлужебный)
		.Когда("ПрочитатьПакетСообщений", ЮТМетоды.МассивПараметров(Консьюмер, Истина, 2, Сессии))
			.Вернуть(Ответ);
	Мокито.Прогон();

КонецПроцедуры

// Возвращает отдельный сценарий десериализации одного ключа.
// Возвращаемое значение:
//  Структура:
//   * Выборка - Структура
//   * Очередь - РегистрСведенийНаборЗаписей.кфкВходящиеСообщения
//   * Правило - см. кфкФоновыеОперацииСлужебный.НовоеОписаниеПравилОбмена
//   * Правила - Соответствие Из КлючИЗначение
//   * Идемпотентные - Массив Из СправочникСсылка.кфкКонсьюмеры
//   * Хэши - РегистрСведенийНаборЗаписей.кфкХэшСуммыСообщений - набор сохраняемых хэшей.
//   * Кэш - Соответствие Из КлючИЗначение
//   * Момент - Структура
Функция НовыйСценарийДедупликации()

	Консьюмер = НовыйКонсьюмер();
	Данные = Новый Структура;
	Данные.Вставить("КлючЗаписи", НовыйКлюч());
	Данные.Вставить("Консьюмер", Консьюмер);
	Данные.Вставить("Топик", "unit-dedup");
	Данные.Вставить("ТекстЖурнала", "");
	Данные.Вставить("ХэшСумма", "");
	Данные.Вставить("ТелоСообщения", кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище("payload"));
	Данные.Вставить("Заголовки", кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище(Новый Соответствие));
	Данные.Вставить("КлючСообщения", "ключ");
	Данные.Вставить("Раздел", 2);
	Данные.Вставить("Смещение", 17);
	Данные.Вставить("ДатаЗаписи", Дата(2026, 1, 1));
	Данные.Вставить("ДатаЗагрузки", Дата(2026, 1, 1));
	Данные.Вставить("ДатаОбработки", Дата(2026, 1, 2));
	Правило = кфкФоновыеОперацииСлужебный.НовоеОписаниеПравилОбмена();
	Правило.Тип = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
	Правило.ИмяМетода = "ОМ_кфкФоновыеОперацииСлужебный_ПолучениеОчистка.ют_УспешнаяДесериализация";
	Правила = Новый Соответствие;
	Правила.Вставить(НРег(XMLСтрока(Консьюмер) + "unit-dedup"), Правило);
	Идемпотентные = Новый Массив; // Массив Из СправочникСсылка.кфкКонсьюмеры
	Идемпотентные.Добавить(Консьюмер);
	Результат = Новый Структура;
	Результат.Вставить("Выборка", Данные);
	Результат.Вставить("Очередь", РегистрыСведений.кфкВходящиеСообщения.СоздатьНаборЗаписей());
	Результат.Вставить("Правило", Правило);
	Результат.Вставить("Правила", Правила);
	Результат.Вставить("Идемпотентные", Идемпотентные);
	Результат.Вставить("Хэши", РегистрыСведений.кфкХэшСуммыСообщений.СоздатьНаборЗаписей());
	Результат.Вставить("Кэш", Новый Соответствие);
	Результат.Вставить("Момент", Новый Структура("Дата,ДатаМС", Дата(2026, 1, 2), 1000000));
	Возврат Результат;

КонецФункции

// Возвращает только собственное сообщение как вход настоящего обработчика.
// Параметры:
//  Ключ - Строка
//  Метка - Число
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса
Функция ВыборкаСобственногоВходящего(Ключ, Метка)

	// Получаем поля записи и сохраненный хэш для повторной обработки.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ключ", Ключ);
	Запрос.УстановитьПараметр("Метка", Метка);
	Запрос.Текст = "ВЫБРАТЬ
	|	Сообщения.КлючЗаписи КАК КлючЗаписи,
	|	Сообщения.ДатаЗагрузкиМС КАК ДатаЗагрузкиМС,
	|	Сообщения.Статус КАК Статус,
	|	Сообщения.Заголовки КАК Заголовки,
	|	Сообщения.ТелоСообщения КАК ТелоСообщения,
	|	Сообщения.Консьюмер КАК Консьюмер,
	|	Сообщения.Топик КАК Топик,
	|	Сообщения.Раздел КАК Раздел,
	|	Сообщения.Смещение КАК Смещение,
	|	Сообщения.КлючСообщения КАК КлючСообщения,
	|	Сообщения.ДатаЗаписи КАК ДатаЗаписи,
	|	Сообщения.ДатаЗагрузки КАК ДатаЗагрузки,
	|	Сообщения.ДатаОбработки КАК ДатаОбработки,
	|	Сообщения.ДлОбработкиМС КАК ДлОбработкиМС,
	|	Сообщения.ТекстЖурнала КАК ТекстЖурнала,
	|	Сообщения.КоличествоОбработок КАК КоличествоОбработок,
	|	Сообщения.МеткаИзмененияМС КАК МеткаИзмененияМС,
	|	ЕСТЬNULL(Хэши.ХэшСумма, """") КАК ХэшСумма
	|ИЗ
	|	РегистрСведений.кфкВходящиеСообщения КАК Сообщения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.кфкХэшСуммыСообщений КАК Хэши
	|		ПО Сообщения.КлючЗаписи = Хэши.КлючЗаписи
	|ГДЕ
	|	Сообщения.КлючЗаписи = &Ключ
	|	И Сообщения.ДатаЗагрузкиМС = &Метка";
	Возврат Запрос.Выполнить().Выбрать();

КонецФункции

#КонецОбласти
